
def get_prt_token_pos_dict():
    return {
        'أ+': ['PRT'],
        
        'ف+': ['PRT'],
        'و+': ['PRT'],
        
        'ب+': ['PRT'],
        'ك+': ['PRT'],
        'ل+': ['PRT'],
        
        'س+': ['PRT'],
        
        'لا+': ['PRT'],
        'ما+': ['PRT'],
        
        '+ني': ['NOM'],
        '+ي': ['NOM'],
        '+نا': ['NOM'],
        
        '+ك': ['NOM'],
        '+كما': ['NOM'],
        '+كم': ['NOM'],
        '+كن': ['NOM'],
        
        '+ه': ['NOM'],
        '+ها': ['NOM'],
        '+هما': ['NOM'],
        '+هم': ['NOM'],
        '+هن': ['NOM'],
        
        '+من': ['NOM'],
        '+ما': ['NOM', 'PRT'],
        '+لا': ['PRT'],
        '+م': ['NOM'],
        '+كو': ['NOM'],
        '+كي': ['NOM'],
        '+ش': ['PRT'],
        
        '+ج': ['NOM'],
        'ع+': ['PRT'],
        'ش+': ['NOM'],
        'ه+': ['NOM'],
    }